شروع.
مقدار عدد را بخوان.
مقدار تفاضل ۱ از ضرب عدد در دو را در دفعات ذخیره کن.

تعداد دفعات بار تکرار کن:الف {
  تعداد دفعات بار تکرار کن:ب {
      مقدار تفاضل الف از عدد را در دال ذخیره کن.
      مقدار تفاضل ب از عدد را در ذال ذخیره کن.
       اگر کمتر است دال از صفر آنگاه حاصل قرینه دال را در دال ذخیره کن.
       اگر کمتر است ذال از صفر آنگاه حاصل قرینه ذال را در ذال ذخیره کن.
       مقدار دال را افزایش بده.
       مقدار ذال را افزایش بده.
       اگر بزرگتر است دال از ذال آنگاه بنویس دال دقت 3. وگرنه بنویس ذال دقت 3.
  }
  سرخط.
}
پایان.

