شروع.
تعداد 10 بار تکرار کن : الف {
	سرخط.
	مقدار الف  را بنویس.

}
پایان.

بنویس |این برنامه یکسری دستورات ورودی و خروجی روی رشته ها را آزمایش می‌کند.\س|.
مقدار |سلام\س| را در رشته بنویس.
مقدار رشته را بنویس.
مقدار رشته را در دومی بنویس.
مقدار دومی را بنویس.
مقدار |سلام | |کاتی\س| را بنویس.
مقدار |سلام کاتی را بنویس.\س| را بنویس.
مقدار 3.14 را در پی بنویس.
مقدار |مقدار پی برابر | پی دقت 0.2  | است.\س| را بنویس.
مقدار ۱۰۰ را در شعاع ذخیره کن.
حاصل |مقدار مساحت برابر است با: | و  ضرب پی در ضرب شعاع در شعاع دقت 8.2 را بنویس.
پایان.
