شروع.

مقدار -1234 را بنویس.
سرخط.
حاصل 4321 را در خروجی بنویس.
سرخط.
حاصل منفی 1234 را در عدد ذخیره کن.
حاصل 2468 را در دومی ذخیره کن.

حاصل نصف عدد را در نصفعدد ذخیره کن.
حاصل ثلث عدد را در ثل ذخیره کن.
حاصل ربع عدد را در رب ذخیره کن.
حاصل خمس عدد را در خم ذخیره کن.
حاصل معکوس عدد را در معکو ذخیره کن.
حاصل قرینه عدد را در قرین ذخیره کن.
          
بنویس |اولی=|. بنویس عدد.
بنویس | دومی=|.
بنویس دومی.
سرخط.

بنویس |نصف عدد=|.
بنویس نصفعدد دقت 0.2.
سرخط.

بنویس |ثلث عدد=|.
بنویس ثل  دقت 0.2.
سرخط.

بنویس |ربع عدد=|.
بنویس رب  دقت 0.2.
سرخط.

بنویس |خمس عدد=|.
بنویس خم  دقت 0.2
سرخط.

بنویس |معکوس عدد=|.
بنویس معکو  دقت 0.6.
سرخط.

بنویس |قرینه عدد=|.
بنویس قرین  دقت 0.6.
سرخط.


بنویس |تست باقیمانده |.
حاصل باقیمانده عدد بر ده را در رقم ذخیره کن.
بنویس رقم.

سرخط.
بنویس |تست تقسیم صحیح |.
حاصل تقسیم صحیح عدد بر ده را در رقم ذخیره کن.
بنویس رقم.

سرخط.
بنویس |تست تقسیم |.
حاصل تقسیم عدد بر ده را در رقم ذخیره کن.
بنویس رقم دقت 0.6.

سرخط.
بنویس |تست تفریق |.
حاصل تفریق عدد از دومی را در رقم ذخیره کن.
بنویس رقم.

سرخط.
بنویس |تست کوچکتری |.
حاصل کوچکتر است عدد از دومی را در رقم ذخیره کن.
بنویس رقم دفت 0.4.
بنویس | باید باشد \27[0;31m1\27[7;0m|.

سرخط.
بنویس |تست بزرگنری |.
حاصل بزرگتر است عدد از دومی را در رقم ذخیره کن.
بنویس رقم.

سرخط.
بنویس |تست کوچکتر نیست |.
حاصل کوچکتر نیست عدد از دومی را در رقم ذخیره کن.
بنویس رقم.

سرخط.
بنویس |تست بزرگنر نیست |.
حاصل بزرگتر نیست عدد از دومی را در رقم ذخیره کن.
بنویس رقم.

سرخط.

بنویس |تست اگر 1\n|.
مقدار 10 را در الف ذخیره کن.
اگر کمترمساوی است الف از 5 آنگاه بنویس |اجرای قسمت آنگاه|. 
وگرنه بنویس |اجرای قسمت وگرنه|.

سرخط.
بنویس |---------------------------------\n|.
بنویس |تست اگر ۲\n|.
مقدار 10 را در الف ذخیره کن.
اگر کمترمساوی است الف از 20 آنگاه بنویس |اجرای قسمت آنگاه|. وگرنه بنویس |اجرای قسمت وگرنه|.
سرخط.


بنویس |تست تکرار|.
  سرخط.
تعداد ۵ بار تکرارکن: شماره {
  مقدار شماره دقت 3.0 را بنویس.
}
سرخط.



بنویس |تست اگر و تکرار ده مرتبه\س|.
مقدار ۱ را در الف ذخیره کن.
اگر کمترمساوی است الف از ۱۰ آنگاه تکرارکن {
       بنویس الف دقت 6.2 .
	 حاصل جمع الف با یک را در الف ذخیره کن.
}
سرخط.

پایان.



