									تعداد تکرار در 5ثانبه
کاتی۱										1.5میلیون
کاتی۲	
	حذف strcmp با تبدیل شناسه ها به عدد:			5.4 میلیون
	ت۱ --> 								6.3میلیون
	استفاده از variant						7میلیون
	استفاده از variant کوچک شده				13.1میلیون
	ارسال محاسبات با آدرس	 					14.1 میلیون
	پشته ۲: پاپ به صورت آدرس: 					14.7میلیون
	استفاده از آدرس در پشته ۱ وتغییر در عملگرهای مقایسه:	25میلیون
	انجام عمل INCR,DECR به صورت درجا و بازگشت فوری 	41.5میلیون	
	استفاده از عملگر اند بیتی برای تست نوع داده:		
	حذف حروف اضافه غیرضروری از دستورات:				
	استفاده از نوع داده صحیح به جای اعشاری در تکرار:
	استفاده از آدرس در فراخوانی print_item

پایتون2	59
پایتون3	40
اکتاو		65
پاسکال  	1000 بیشتر


حل مشکل کاراکترهای  مانند 
	فاصله مجازی
	زیرخط

